<?php

namespace App\Exceptions;

use Exception;

class JsonException extends Exception 
{
    /**
     * 错误码列表
     * 10000 - 19999 基本错误
     */
    protected $code_list = [
        /*---分类错误 start-----*/
        20001 => [
            'msg' => '不存在任何渠道!'
        ],
        20002 => [
            'msg' => '分类不存在！'
        ],
        20003 => [
            'msg' => '分类已存在！'
        ],
        20004 => [
            'msg' => '创建分类失败!'
        ],
        20005 => [
            'msg' => '该分类没找到任何发布渠道!'
        ],
        20006 => [
            'msg' => '没找到任何分类!'
        ],
        20007 => [
            'msg' => '选择的分类有误,请进入分类管理中选择模板!'
        ],
        20008 => [
            'msg' => '分类名称不能为空'
        ],
        20009 => [
            'msg' => '平台并不存在!',
        ],
        20010 => [
            'msg' => '此分类下有文章，故不得添加子分类！'
        ],
        20011 => [
            'msg' => '选择的分类拥有子分类，请选择！',
        ],
        20012 => [
            'msg' => '没找到任何在首页中显示的分类!',
        ],
        20013 => [
            'msg' => '系统分类，不得修改！',
        ],
        20014 => [
            'msg' => '分类路径只允许数字、大小写字母、下划线，长度在1-15之间！',
        ],
        20015 => [
            'msg' => '分类路径不能为空！',
        ],
        20016 => [
            'msg' => '分类路径已经存在！',
        ],
        20017 => [
            'msg' => '替换分类路径失败!'
        ],
        20018 => [
            'msg' => '分类路径不允许全是下划线!'
        ],
        20019 => [
            'msg' => '分类路径不允许全是数字!'
        ],
        20020 => [
            'msg' => '请选择分类模版!'
        ],
        20021 => [
            'msg' => '分类描述不能为空!'
        ],
        20022 => [
            'msg' => '分类ID非法!'
        ],
        20023 => [
            'msg' => '排序值非法!'
        ],
        20024 => [
            'msg' => '保存分类发布渠道失败!'
        ],
        20025 => [
            'msg' => '该发布渠道没找到任何分类!'
        ],
        20026 => [
            'msg' => '该分类没找到任何发布平台!'
        ],
        20027 => [
            'msg' => '该渠道不存在!'
        ],
        20028 => [
            'msg' => '该模块已有相同发布渠道指定!'
        ],
        /*---分类错误 end-----*/

        /*---文章错误 start---*/
        30000 => [
            'msg' => '不存在任何常用标签!',
        ],
        30001 => [
            'msg' => '已存在足够的常用标签!'
        ],
        30002 => [
            'msg' => '已存在同名称标签!',
        ],
        30003 => [
            'msg' => '没找到任何标签!',
        ],
        30004 => [
            'msg' => '添加文章失败!'
        ],
        30005 => [
            'msg' => '没找到任何文章详情!'
        ],
        30006 => [
            'msg' => '该文章没找到任何标签!'
        ],
        30007 => [
            'msg' => '没找到任何文章!',
        ],
        30008 => [
            'msg' => '此文章并不处于待审核状态'
        ],
        30009 => [
            'msg' => '没找到任何文章阅读数量!'
        ],
        30010 => [
            'msg' => '此分类不得在此平台上查看！',
        ],
        30011 => [
            'msg' => '文章标签不得少于1个或者多于3个！',
        ],
        30012 => [
            'msg' => '找不到任何文章!',
        ],
        30013 => [
            'msg' => '此自定义链接已被使用!',
        ],
        30014 => [
            'msg' => '找不到任何用户点赞记录！',
        ],
        30015 => [
            'msg' => '文章标题已经存在！',
        ],
        30016 => [
            'msg' => '文章发布时间不能小于当前时间！',
        ],
        30017 => [
            'msg' => '请至少选择一个发布渠道！',
        ],
        30018 => [
            'msg' => '请选择分类！',
        ],
        30019 => [
            'msg' => '自定义URL不能为空！',
        ],
        30020 => [
            'msg' => '请选择发布时间！',
        ],
        30021 => [
            'msg' => '来源不能为空！',
        ],
        30022 => [
            'msg' => '标题不能为空！',
        ],
        30023 => [
            'msg' => '内容不能为空！',
        ],
        30024 => [
            'msg' => '发布时间格式错误！',
        ],
        30025 => [
            'msg' => '请至少选择一个发布平台！',
        ],
        30026 => [
            'msg' => '用户已经点赞过该文章！',
        ],
        30027 => [
            'msg' => '找不到任何用户踩记录！',
        ],
        30028 => [
            'msg' => '用户已经踩过该文章！',
        ],

        30100 => [
            'msg' => '请上传封面图片！',
        ],
        30101 => [
            'msg' => '请输入要闻描述！',
        ],
        30102 => [
            'msg' => '请上传幻灯图片！',
        ],

        30200 => [
            'msg' => '股票名称不能为空！',
        ],
        30201 => [
            'msg' => '股票代码不能为空！',
        ],
        30202 => [
            'msg' => '预期收益不能为空！',
        ],
        30203 => [
            'msg' => '推荐理由不能为空！',
        ],
        30204 => [
            'msg' => '股票代码不合法！',
        ],
        30210 => [
            'msg' => '股票代码和股票名称不一致！',
        ],

        30300 => [
            'msg' => '诊股问题不能为空！',
        ],
        30301 => [
            'msg' => '在线诊股不能为空！',
        ],
        30302 => [
            'msg' => '诊股专家不能为空！',
        ],

        30400 => [
            'msg' => '时间评级非法参数！',
        ],
        30401 => [
            'msg' => '影响板块非法参数！',
        ],

        31000 => [
            'msg' => '搜索请选择模板！',
        ],
        31001 => [
            'msg' => '该文章没找到任何发布渠道!'
        ],
        31010 => [
            'msg' => '该文章没找到任何关联股票!'
        ],
        31020 => [
            'msg' => '该文章没找到任何关联行业!'
        ],
        31030 => [
            'msg' => '该文章没找到任何关联概念!'
        ],
        31040 => [
            'msg' => '该文章没找到任何关联大盘!'
        ],
        31050 => [
            'msg' => '该文章没找到任何关联资讯模块!'
        ],
        31060 => [
            'msg' => '该文章没找到任何关联行情模块!'
        ],

        //这里开始是文章评论相关的错误码
        32000 => [
            'msg' => '文章ID参数非法',
        ],
        32001 => [
            'msg' => '用户ID参数非法',
        ],
        32002 => [
            'msg' => '评论内容不能为空',
        ],
        32020 => [
            'msg' => '评论添加失败',
        ],
        32030 => [
            'msg' => '没有相关评论',
        ],
        32040   =>  [
            'msg' =>  '用户已经点赞过该评论'
        ],
        32050   =>  [
            'msg' =>  '构建用户-点赞评论关系失败'
        ],
        32060   =>  [
            'msg' =>  '增加评论点赞数失败'
        ],
        32070   =>  [
            'msg' =>  '取消评论点赞数失败'
        ],

        /*---文章错误 end-----*/

        /*---系统用户相关错误 start-----*/
        40000 => [
            'msg' => '权限名已经存在',
        ],
        40001 => [
            'msg' => ' 该路由已经存在!'
        ],
        40002 => [
            'msg' => '创建权限失败!'
        ],
        40003 => [
            'msg' => '没找到任何权限!'
        ],

        40100 => [
            'msg' => '创建角色失败!'
        ],
        40101 => [
            'msg' => '创建角色-权限关系失败!'
        ],
        40102 => [
            'msg' => '没找到任何角色!'
        ],
        40103 => [
            'msg' => '角色名已经存在',
        ],
        40104 => [
            'msg' => '角色名不能为空',
        ],
        40105 => [
            'msg' => '请选择权限',
        ],

        40200 => [
            'msg' => '账户名已经存在',
        ],
        40201 => [
            'msg' => '邮件已经存在',
        ],
        40202 => [
            'msg' => '手机已经存在',
        ],
        40203 => [
            'msg' => '创建账户失败!'
        ],
        40204 => [
            'msg' => '没找到任何账户!'
        ],
        40205 => [
            'msg' => '请选择角色!'
        ],
        40206 => [
            'msg' => '修改账户失败!'
        ],
        40207 => [
            'msg' => '账户密码不正确!'
        ],
        40208 => [
            'msg' => '删除角色权限关系失败!'
        ],
        40209 => [
            'msg' => '账户名不能为空!'
        ],
        40210 => [
            'msg' => '密码不能为空!'
        ],
        40211 => [
            'msg' => '删除账户失败!'
        ],

        40300 => [
            'msg' => '删除权限失败!'
        ],
        40301 => [
            'msg' => '删除权限角色关系失败!'
        ],
        40302 => [
            'msg' => '修改权限失败'
        ],
        40303 => [
            'msg' => '权限名称不能为空'
        ],
        40304 => [
            'msg' => '权限路由不能为空'
        ],
        40305 => [
            'msg' => '权限排序必须是数字'
        ],
        /*---系统用户相关错误 end-----*/

        /*---基本错误 end-----*/
        '10000'   =>  [
            'msg'   =>  '参数错误'
        ],
        '10001'   =>  [
            'msg'   =>  '命令不存在!'
        ],
        '10002'   =>  [
            'msg'   =>  '请输入正确的手机号码！'
        ],
        '10003'   =>  [
            'msg'   =>  '获取手机验证码类型有误!'
        ],
        '10004'   =>  [
            'msg'   =>  '请输入正确的邮箱!'
        ],
        '10100'   =>  [
            'msg'   =>  '私钥不可用!'
        ],
        '10101'   =>  [
            'msg'   =>  '公钥不可用!'
        ],
        '10102'   =>  [
            'msg'   =>  '公钥不存在!'
        ],
        '10103'   =>  [
            'msg'   =>  '私钥不存在!'
        ],
        '10104'   =>  [
            'msg'   =>  'APP公钥不存在!'
        ],
        '10105'   =>  [
            'msg'   =>  'APP公钥不可用!'
        ],
        '10200'   =>  [
            'msg'   =>  '加密参数异常!',
            'status_code'   =>  403
        ],
        '10201'   =>  [
            'msg'   =>  '加密校验失败!',
        ],
        '10300'   =>  [
            'msg'   =>  '获取接口地址失败!'
        ],
        '10301'   =>  [
            'msg'   =>  '接口请求失败!'
        ],
        '10302'   =>  [
            'msg'   =>  '分页初始化异常!'
        ],
        '10400' => [
            'msg' => '您没有权限执行该操作！',
        ],
    ];


    /**
     * 构造函数
     */
    public function __construct($code, $data = [])
    {
        $this->code = $code;
        $this->data = $data;
    }


    /**
     * 获取错误信息
     */
    public function getErrorMsg()
    {
        $re = [
            'code' => 10000,
            'msg'  => $this->code_list[10000]['msg'],
            'data' => '',
            'module'    =>  config('site.module_name'),
        ];
        if (empty($this->code_list[$this->code])) {
            return $re;
        }

        $re['code'] = $this->code;
        $re['msg']  = $this->code_list[$this->code]['msg'];
        $re['data'] = $this->data;
        $re['module'] = config('site.module_name');

        return $re;
    }
}
